In [2]:
from pandas import DataFrame
import pandas as pd
df=pd.DataFrame([[19,14,18,19],
                 [18,10,17,16],
                 [17,16,18,15]],
                columns=['OSA','JAVA','SE','DS'])
df

   OSA  JAVA  SE  DS
0   19    14  18  19
1   18    10  17  16
2   17    16  18  15

In [4]:
df.sum()

OSA     54
JAVA    40
SE      53
DS      50
dtype: int64

In [8]:
df.max()

OSA     19
JAVA    16
SE      18
DS      19
dtype: int64

In [11]:
df.min()

OSA     17
JAVA    10
SE      17
DS      15
dtype: int64

In [12]:
df.mean()

OSA     18.000000
JAVA    13.333333
SE      17.666667
DS      16.666667
dtype: float64

In [13]:
df.count()

OSA     3
JAVA    3
SE      3
DS      3
dtype: int64

In [15]:
df.median()

OSA     18.0
JAVA    14.0
SE      18.0
DS      16.0
dtype: float64

In [16]:
df.describe()

        OSA       JAVA         SE         DS
count   3.0   3.000000   3.000000   3.000000
mean   18.0  13.333333  17.666667  16.666667
std     1.0   3.055050   0.577350   2.081666
min    17.0  10.000000  17.000000  15.000000
25%    17.5  12.000000  17.500000  15.500000
50%    18.0  14.000000  18.000000  16.000000
75%    18.5  15.000000  18.000000  17.500000
max    19.0  16.000000  18.000000  19.000000

In [17]:
df.agg(['sum','min','max'])

     OSA  JAVA  SE  DS
sum   54    40  53  50
min   17    10  17  15
max   19    16  18  19

In [19]:
from pandas import DataFrame
df1=DataFrame(
            [
                ['Aryan','Singh','Full Time','administraction',2,20000],
                ['Rohan','Agarwal','intern','Technical',3,50000],
                ['Rjya','Shah','Full Time','administraction',5,100000],
                ['Yash','Bhaita','Part Time','Technical',7,100000],
                ['Siddhant','Khanna','Full Time','Management',6,200000],
            ]
            ,columns=['Frist Name','Last Name','Type','Department','YoE','Salary']
            )
df1

  Frist Name Last Name       Type       Department  YoE  Salary
0      Aryan     Singh  Full Time  administraction    2   20000
1      Rohan   Agarwal     intern        Technical    3   50000
2       Rjya      Shah  Full Time  administraction    5  100000
3       Yash    Bhaita  Part Time        Technical    7  100000
4   Siddhant    Khanna  Full Time       Management    6  200000

In [23]:
df1.groupby(['Type']).sum()

           YoE  Salary
Type
Full Time   13  320000
Part Time    7  100000
intern       3   50000

In [26]:
df1.head(2)

  Frist Name Last Name       Type       Department  YoE  Salary
0      Aryan     Singh  Full Time  administraction    2   20000
1      Rohan   Agarwal     intern        Technical    3   50000

In [28]:
df1.tail(2)

  Frist Name Last Name       Type  Department  YoE  Salary
3       Yash    Bhaita  Part Time   Technical    7  100000
4   Siddhant    Khanna  Full Time  Management    6  200000

In [29]:
df1.groupby(['Type']).mean()

                YoE         Salary
Type
Full Time  4.333333  106666.666667
Part Time  7.000000  100000.000000
intern     3.000000   50000.000000

In [30]:
df1.groupby(['Type','Department']).sum()

                           YoE  Salary
Type      Department
Full Time Management         6  200000
          administraction    7  120000
Part Time Technical          7  100000
intern    Technical          3   50000

In [32]:
df1.groupby(['Type','Department']).mean()

                           YoE    Salary
Type      Department
Full Time Management       6.0  200000.0
          administraction  3.5   60000.0
Part Time Technical        7.0  100000.0
intern    Technical        3.0   50000.0

In [33]:
df1.groupby(['Department','Type']).mean()

                           YoE    Salary
Department      Type
Management      Full Time  6.0  200000.0
Technical       Part Time  7.0  100000.0
                intern     3.0   50000.0
administraction Full Time  3.5   60000.0